import java.util.ArrayList;
import java.util.List;

/**
 * Клас для відправки сповіщень
 */
public class СервісСповіщень {
    private List<String> адресати;
    private List<Підписник> підписники = new ArrayList<>();

    /**
     * Конструктор класу СервісСповіщень
     */
    public СервісСповіщень() {
        this.адресати = new ArrayList<>();
    }

    /**
     * Додає адресата до списку
     * @param адресат адрес електронної пошти або ім'я
     */
    public void додатиАдресата(String адресат) {
        адресати.add(адресат);
    }

    /**
     * Додає підписника
     */
    public void додатиПідписника(Підписник підписник) {
        підписники.add(підписник);
    }

    /**
     * Надіслати сповіщення
     * @param текст текст сповіщення
     * @return результат відправки
     */
    public boolean надіслати(String текст) {
        if (адресати.isEmpty() && підписники.isEmpty()) {
            System.out.println("Немає адресатів або підписників для надсилання сповіщення.");
            return false;
        }
        for (String адресат : адресати) {
            System.out.println("Відправка сповіщення: '" + текст + "' до " + адресат);
        }
        for (Підписник підписник : підписники) {
            підписник.deliverMessage(текст);
        }
        return true;
    }
}